sh mkdir WORK
define_design_lib WORK -path ./WORK
remove_design -designs

analyze -format vhdl ../inccomp.vhd
elaborate inccomp -architecture behavioral -library WORK
uniquify
compile -exact_map
write -hierarchy -format ddc -output inccomp.ddc
ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../inccomp.sdf
write -f verilog -hierarchy -output ../inccomp_netlist.v